emacs_lsp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-29 Sun 17:01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs - Language Server Protocol</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs - Language Server Protocol</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org839388c">Introduction</a></li>
<li><a href="#orga9f6c38">C++</a>
<ul>
<li><a href="#orgff3b371">Installation</a>
<ul>
<li><a href="#org73eab1e"><code>cquery</code></a>
<ul>
<li><a href="#org324d83a">Prerequisite</a></li>
<li><a href="#org28e8705">Install binary package</a></li>
<li><a href="#org19486f1">Build from source codes</a></li>
</ul>
</li>
<li><a href="#org5350102"><code>lsp-mode</code></a></li>
<li><a href="#org550677e"><code>company-lsp</code></a></li>
</ul>
</li>
<li><a href="#orgc1f6be6">Configuration</a></li>
<li><a href="#org84f9f9b">Usage</a>
<ul>
<li><a href="#org6ee0e37"><code>compile_commands.json</code></a></li>
<li><a href="#orge07046b"><code>.cquery</code></a></li>
<li><a href="#org738a264">Provision</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org839388c" class="outline-2">
<h2 id="org839388c">Introduction</h2>
<div class="outline-text-2" id="text-org839388c">
<p>
Language server protocol (LSP) offers a uniform specification between a client and a server<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>
<blockquote>
<p>
The Language Server protocol is used between a tool (the client) and a language smartness provider (the server) to integrate features like auto complete, go to definition, find all references and alike into the tool
</p>
</blockquote>
<p>
With LSP, different clients and development tools, e.g., integrated development environment (IDE), can share a common server. Taking C/C++ for instance, various clients, e.g., Emacs, Vim, Eclipse, etc. can communicate with a common server with their own clients. For Emacs, its client is enbodied as a mode, <code>lsp-mode</code><sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>

<p>
Maskray has provided a good summary of <code>cquery</code> for reference<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>. This post just records the installation and configuration of LSP for C/C++.
</p>
</div>
</div>
<div id="outline-container-orga9f6c38" class="outline-2">
<h2 id="orga9f6c38">C++</h2>
<div class="outline-text-2" id="text-orga9f6c38">
<p>
<a href="https://github.com/jacobdufault/cquery">cquery</a> provides an complete LSP for C/C++/Object-C, including a LSP server and a LSP client (which depends on <code>lsp-mode</code>). <code>cquery</code> can be installed and configured following a procedure as below.
</p>
</div>
<div id="outline-container-orgff3b371" class="outline-3">
<h3 id="orgff3b371">Installation</h3>
<div class="outline-text-3" id="text-orgff3b371">
</div>
<div id="outline-container-org73eab1e" class="outline-4">
<h4 id="org73eab1e"><code>cquery</code></h4>
<div class="outline-text-4" id="text-org73eab1e">
</div>
<div id="outline-container-org324d83a" class="outline-5">
<h5 id="org324d83a">Prerequisite</h5>
<div class="outline-text-5" id="text-org324d83a">
<div class="org-src-container">
<pre class="src src-sh">pacman -S clang llvm
</pre>
</div>
</div>
</div>
<div id="outline-container-org28e8705" class="outline-5">
<h5 id="org28e8705">Install binary package</h5>
<div class="outline-text-5" id="text-org28e8705">
<div class="org-src-container">
<pre class="src src-sh">pacman -S cquery-git
</pre>
</div>
</div>
</div>
<div id="outline-container-org19486f1" class="outline-5">
<h5 id="org19486f1">Build from source codes</h5>
<div class="outline-text-5" id="text-org19486f1">
<div class="org-src-container">
<pre class="src src-sh">git clone https://github.com/jacobdufault/cquery --recursive
cd cquery
python waf configure --prefix /opt/cquery --use-system-clang
python waf build
python waf install
ln -s /opt/cquery/bin/cquery /usr/local/bin
mkdir ~/.emacs.d/cquery
cp emacs/cquery.el ~/.emacs.d/cquery
cp -r third_party /opt/cquery
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5350102" class="outline-4">
<h4 id="org5350102"><code>lsp-mode</code></h4>
<div class="outline-text-4" id="text-org5350102">
<p>
<code>lsp-mode</code> can be easily installed via ELPA.
</p>
</div>
</div>
<div id="outline-container-org550677e" class="outline-4">
<h4 id="org550677e"><code>company-lsp</code></h4>
<div class="outline-text-4" id="text-org550677e">
<p>
For LSP, <code>company-lsp</code> is an optional package. It is essentially the company backend for <code>lsp-mode</code>, which can also be installed via ELPA.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc1f6be6" class="outline-3">
<h3 id="orgc1f6be6">Configuration</h3>
<div class="outline-text-3" id="text-orgc1f6be6">
<p>
Add following entries into <code>~/.emacs.d/init.el</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path "~/.emacs.d/cquery")
(require 'cquery)
(add-hook 'c-mode-common-hook 'lsp-cquery-enable)
(setq cquery-cache-dir "/tmp/cquery_cache")
</pre>
</div>
<p>
With LSP, two company backends, <code>company-semantic</code> and <code>company-clang</code> can be removed if used before.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq company-backends (delete 'company-semantic company-backends))
(setq company-backends (delete 'company-clang company-backends))
</pre>
</div>
<p>
If <code>company-lsp</code> is installed, it can be appended in variable <code>company-backends</code> by adding the following entry in <code>~/.emacs.d/init.el</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(push 'company-lsp company-backends)
</pre>
</div>
</div>
</div>
<div id="outline-container-org84f9f9b" class="outline-3">
<h3 id="org84f9f9b">Usage</h3>
<div class="outline-text-3" id="text-org84f9f9b">
</div>
<div id="outline-container-org6ee0e37" class="outline-4">
<h4 id="org6ee0e37"><code>compile_commands.json</code></h4>
<div class="outline-text-4" id="text-org6ee0e37">
<p>
In the normal utilization of LSP, a compilation database is required<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>, i.e., <code>compile_commands.json</code>. It can be generated by a variety of tools, e.g., <a href="https://cmake.org">cmake</a>, <a href="https://github.com/rizsotto/Bear">build ear</a>, <a href="https://ninja-build.org">ninja</a>, <a href="https://waf.io">waf</a>, etc.
</p>

<p>
Taking <code>build ear</code> for instance, which can be installed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S bear
</pre>
</div>
<p>
a <code>compile_commands.json</code> can be generated by compiling the target project, e.g.
</p>
<div class="org-src-container">
<pre class="src src-sh">bear make -j
</pre>
</div>
</div>
</div>
<div id="outline-container-orge07046b" class="outline-4">
<h4 id="orge07046b"><code>.cquery</code></h4>
<div class="outline-text-4" id="text-orge07046b">
<p>
If <code>compile_commands.json</code> cannot be generated, an alternative solution is to create a file <code>.cquery</code> in the root directory of each project with its content as follows.
</p>
<div class="org-src-container">
<pre class="src src-sh"># Driver
/usr/bin/clang

# Language
-xc++
-std=c++14

# Includes
-I/opt/cquery/third_party
</pre>
</div>
</div>
</div>
<div id="outline-container-org738a264" class="outline-4">
<h4 id="org738a264">Provision</h4>
<div class="outline-text-4" id="text-org738a264">
<p>
By default, the LSP client uses <code>company-capf</code> for completion, which is a company backend. Therefore, function <code>company-complete</code> can list the candidates for completion offered by LSP.
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-.</code></td>
<td class="org-left"><code>xref-find-definitions</code></td>
</tr>

<tr>
<td class="org-left"><code>M-,</code></td>
<td class="org-left"><code>xref-pop-marker-stack</code></td>
</tr>

<tr>
<td class="org-left"><code>C-M-i</code></td>
<td class="org-left"><code>complete-symbol</code></td>
</tr>

<tr>
<td class="org-left"><code>C-M-.</code></td>
<td class="org-left"><code>xref-find-apropos</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="http://langserver.org/">http://langserver.org/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://github.com/emacs-lsp/lsp-mode">https://github.com/emacs-lsp/lsp-mode</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="http://maskray.me/blog/2017-12-03-c++-language-server-cquery">http://maskray.me/blog/2017-12-03-c++-language-server-cquery</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://sarcasm.github.io/notes/dev/compilation-database.html">https://sarcasm.github.io/notes/dev/compilation-database.html</a>
</p></div></div>


</div>
</div></div>
</body>
</html>